---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.ConduitSizeSettings
source: html/18c165ae-0993-f231-b695-d99f75a7b444.htm
---
# ConduitSizeSettings Methods

Inserts a new ConduitSize in to the conduit size settings. The conduit standard name determines the location of the new size in the size table.